<?php

// DONE: добавить журналирование действий пользователя
// TODO: написать методы TransportICQ::send(), TransportJabber::send(), TransportSMS::send()
// DONE: дописать фильтрацию в журналах документов для отбора процессов по критериям
// DONE: продумать возможность делигирования полномочий на выполнение действий
// DONE: рефакторинг классов - уменьшить количество запросов в БД
// TODO: множественное исполнение действий разными пользователями
// TODO: множественные значения свойств при множественном исполнении

?>